import re

class AmharicNormalizer:
    @staticmethod
    def normalize(norm):
        substitutions = [
            ["ሀ", "ሃ"], ["ሐ", "ሃ"], ["ሓ", "ሃ"], ["ኅ", "ሃ"], ["ኻ", "ሃ"], ["ኃ", "ሃ"], ["ዅ", "ሁ"], ["ሗ", "ኋ"], ["ኁ", "ሁ"], ["ኂ", "ሂ"],
            ["ኄ", "ሄ"], ["ዄ", "ሄ"], ["ኅ", "ህ"], ["ኆ", "ሆ"], ["ሑ", "ሁ"], ["ሒ", "ሂ"], ["ሔ", "ሄ"], ["ሕ", "ህ"], ["ሖ", "ሆ"], ["ኾ", "ሆ"],
            ["ሠ", "ሰ"], ["ሡ", "ሱ"], ["ሢ", "ሲ"], ["ሣ", "ሳ"], ["ሤ", "ሴ"], ["ሥ", "ስ"], ["ሦ", "ሶ"], ["ዐ", "አ"], ["ዑ", "ኡ"], ["ዒ", "ኢ"],
            ["ዓ", "አ"], ["ኣ", "አ"], ["ዔ", "ኤ"], ["ዕ", "እ"], ["ዖ", "ኦ"], ["ፀ", "ጸ"], ["ፁ", "ጹ"], ["ጺ", "ፂ"], ["ጻ", "ፃ"], ["ጼ", "ፄ"],
            ["ፅ", "ጽ"], ["ፆ", "ጾ"], ["ሼ", "ሸ"], ["ሺ", "ሽ"], ["ዲ", "ድ"], ["ጄ", "ጀ"], ["ጂ", "ጅ"], ["ዉ", "ው"], ["ዎ", "ወ"], ["ዴ", "ደ"],
            ["ቼ", "ቸ"], ["ቺ", "ች"], ["ዬ", "የ"], ["ዪ", "ይ"], ["ጬ", "ጨ"], ["ጪ", "ጭ"], ["ኜ", "ኘ"], ["ኚ", "ኝ"], ["ዤ", "ዠ"], ["ዢ", "ዥ"],
        ]
        re_substitutions = [
            [r"ሉ[ዋአ]", "ሏ"], [r"ሙ[ዋአ]", "ሟ"], [r"ቱ[ዋአ]", "ቷ"], [r"ሩ[ዋአ]", "ሯ"], [r"ሱ[ዋአ]", "ሷ"], [r"ሹ[ዋአ]", "ሿ"],
            [r"ቁ[ዋአ]", "ቋ"], [r"ቡ[ዋአ]", "ቧ"], [r"ቹ[ዋአ]", "ቿ"], [r"ሁ[ዋአ]", "ኋ"], [r"ኑ[ዋአ]", "ኗ"], [r"ኙ[ዋአ]", "ኟ"],
            [r"ኩ[ዋአ]", "ኳ"], [r"ዙ[ዋአ]", "ዟ"], [r"ጉ[ዋአ]", "ጓ"], [r"ደ[ዋአ]", "ዷ"], [r"ጡ[ዋአ]", "ጧ"], [r"ጩ[ዋአ]", "ጯ"],
            [r"ጹ[ዋአ]", "ጿ"], [r"ፉ[ዋአ]", "ፏ"], [r"ቊ", "ቁ"], [r"ኵ", "ኩ"], [r"\s+", " "]
        ]

        for old_char, new_char in substitutions:
            norm = norm.replace(old_char, new_char)

        for old_char, new_char in re_substitutions:
            norm = re.sub(old_char, new_char, norm)

        return norm
    
    @staticmethod
    def removePunctuation(text):
        punctuations = ['!', '@', '#', '\\$', '%', '\\^', '&', '\\*', '\\(', '\\)', '\\[', '\\]', '\\{', '\\}', ';', ':', '\\.', ',', '<', '>', '\\?', '/', '\\|', '~', '=', '\\+', '«', '»', '“', '”', '›', '’', '‘', "'", '\\"', '፡', '።', '፤', '፥', '፦', '፧', '፨', '…','፣', '-']
        text = re.sub(f"[{''.join(punctuations)}]", '', text)
        return AmharicNormalizer.removeExtraSpaces(text)

    @staticmethod
    def removeNonAmharicChars(text):
        text = re.sub('[a-zA-Z0-9]', '', text)
        return AmharicNormalizer.removeExtraSpaces(text)

    @staticmethod
    def removeExtraSpaces(text):
        text = re.sub('\s+', ' ', text).strip()
        return text

    @staticmethod
    def removeStopWords(text):
        stopwords = {
        "ህ-ን", "እንደ", "የ", "አል", "ው", "ኡ", "በ", "ተ", "ለ", "ን", "ኦች", "ኧ", "ና", "ከ", "እን", "አንድ", "አይ", "አዎ",
          "አቸው", "ት", "መ", "አ", "አት", "ዎች", "ም", "አስ", "ኡት", "ላ", "ይ", "ማ", "ያ", "አ", "ቶ", "እንዲ", 
         "የሚ", "ኦ", "ይ", "እየ", "ሲ", "ብ", "ወደ", "ሌላ", "ጋር", "ኡ", "እዚህ", "አንድ", "ውስጥ", "እንድ", "እ-ል", "ን-ብ-ር", 
         "በኩል", "ል", "እስከ", "እና", "ድ-ግ-ም", "መካከል", "ኧት", "ሊ", "አይ", "ምክንያት", "ይህ", "ኧች", "ኢት", "ዋና", "አን", 
         "እየ", "ስለ", "ች", "ስ", "ቢ", "ብቻ", "በየ", "ባለ", "ጋራ", "ኋላ", "እነ", "አም", "ሽ", "አዊ", "ዋ", "ያለ", "ግን", "ምን", 
         "አችን", "ወይዘሮ", "ወዲህ", "ማን", "ዘንድ", "የት", "ናቸው", "ላ", "ይሁን", "ወይም", "ታች", "እዚያ", "እጅግ", "እንጅ", "በጣም", 
         "ወዘተ", "ጅ-ም-ር", "አሁን", "ከነ", "ተራ", "ም-ል", "ጎሽ", "አዎ", "እሽ", "ጉዳይ", "ረገድ", "ያህል", "ይልቅ", "ዳር", "እንኳ", 
         "አዎን", "ብ-ዝ", "ጥቂት", "እኔ", "አንተ", "እርስዎ", "እሳቸው", "እሱ", "አንች", "እኛ", "እነሱ", "እናንተ", "ይኸ", "የቱ", "መቼ", 
         "ወይዘሪት", "ትናንት", "ይኽ", "ኤል", "ኦቸ", "ኢዋ", "የለ", "ሰሞን", "ፊት", "ምንጊዜ", "አቸን", "ኧም", "አወ", "ኢያ", "ነገ", 
         "ትላንት", "ኣት", "እንጃ", "ድ-ር-ግ", "መልክ"
        }

        cleaned_text = ' '.join(word for word in text.split() if word not in stopwords)

        return AmharicNormalizer.removeExtraSpaces(cleaned_text)

    
        