import re

class AmharicNormalizer:
    @staticmethod
    def normalize(norm):
        substitutions = [
            ["ሀ", "ሃ"], ["ሐ", "ሃ"], ["ሓ", "ሃ"], ["ኅ", "ሃ"], ["ኻ", "ሃ"], ["ኃ", "ሃ"], ["ዅ", "ሁ"], ["ሗ", "ኋ"], ["ኁ", "ሁ"], ["ኂ", "ሂ"],
            ["ኄ", "ሄ"], ["ዄ", "ሄ"], ["ኅ", "ህ"], ["ኆ", "ሆ"], ["ሑ", "ሁ"], ["ሒ", "ሂ"], ["ሔ", "ሄ"], ["ሕ", "ህ"], ["ሖ", "ሆ"], ["ኾ", "ሆ"],
            ["ሠ", "ሰ"], ["ሡ", "ሱ"], ["ሢ", "ሲ"], ["ሣ", "ሳ"], ["ሤ", "ሴ"], ["ሥ", "ስ"], ["ሦ", "ሶ"], ["ዐ", "አ"], ["ዑ", "ኡ"], ["ዒ", "ኢ"],
            ["ዓ", "አ"], ["ኣ", "አ"], ["ዔ", "ኤ"], ["ዕ", "እ"], ["ዖ", "ኦ"], ["ፀ", "ጸ"], ["ፁ", "ጹ"], ["ጺ", "ፂ"], ["ጻ", "ፃ"], ["ጼ", "ፄ"],
            ["ፅ", "ጽ"], ["ፆ", "ጾ"], ["ሼ", "ሸ"], ["ሺ", "ሽ"], ["ዲ", "ድ"], ["ጄ", "ጀ"], ["ጂ", "ጅ"], ["ዉ", "ው"], ["ዎ", "ወ"], ["ዴ", "ደ"],
            ["ቼ", "ቸ"], ["ቺ", "ች"], ["ዬ", "የ"], ["ዪ", "ይ"], ["ጬ", "ጨ"], ["ጪ", "ጭ"], ["ኜ", "ኘ"], ["ኚ", "ኝ"], ["ዤ", "ዠ"], ["ዢ", "ዥ"],
        ]
        re_substitutions = [
            [r"ሉ[ዋአ]", "ሏ"], [r"ሙ[ዋአ]", "ሟ"], [r"ቱ[ዋአ]", "ቷ"], [r"ሩ[ዋአ]", "ሯ"], [r"ሱ[ዋአ]", "ሷ"], [r"ሹ[ዋአ]", "ሿ"],
            [r"ቁ[ዋአ]", "ቋ"], [r"ቡ[ዋአ]", "ቧ"], [r"ቹ[ዋአ]", "ቿ"], [r"ሁ[ዋአ]", "ኋ"], [r"ኑ[ዋአ]", "ኗ"], [r"ኙ[ዋአ]", "ኟ"],
            [r"ኩ[ዋአ]", "ኳ"], [r"ዙ[ዋአ]", "ዟ"], [r"ጉ[ዋአ]", "ጓ"], [r"ደ[ዋአ]", "ዷ"], [r"ጡ[ዋአ]", "ጧ"], [r"ጩ[ዋአ]", "ጯ"],
            [r"ጹ[ዋአ]", "ጿ"], [r"ፉ[ዋአ]", "ፏ"], [r"ቊ", "ቁ"], [r"ኵ", "ኩ"], [r"\s+", " "]
        ]

        for old_char, new_char in substitutions:
            norm = norm.replace(old_char, new_char)

        for old_char, new_char in re_substitutions:
            norm = re.sub(old_char, new_char, norm)

        return norm
